============================================
comments
============================================

<!-- comment --> inline text <!-- inline comment -->
newline text
<!-- newline comment -->
--------------------------------------------

(source_file
	(comment)
	(item (text))
	(comment)
	(item (text))
	(comment))

============================================
text
============================================
validtext: 123456789.
--------------------------------------------
(source_file
	(item (text)))

============================================
naked variables dot property
============================================
$variable
$variable.property
$variable.property.subproperty
This is $inlinevariable.dotProperty item
--------------------------------------------
(source_file
	(item (naked_variable))
	(item (naked_variable (dotProperty)))
	(item (naked_variable (dotProperty) (dotProperty)))
	(item (text))
	(item (naked_variable (dotProperty)))
	(item (text))
)
============================================
naked variable square property
============================================
$inlinevariable[100]
$inlinevariable["property"]
$inlinevariable['property']
$inlinevariable[$indexOrPropertyVariable]
$inlinevariable['property'][50][$indexOrPropertyVariable]
This is mixed $inlinevariable['property'].property[50][$property] items
--------------------------------------------
(source_file
	(item (naked_variable (squareProperty (number))))
	(item (naked_variable (squareProperty (string))))
	(item (naked_variable (squareProperty (string))))
	(item (naked_variable (squareProperty (naked_variable))))
	(item (naked_variable (squareProperty (string)) (squareProperty (number)) (squareProperty (naked_variable))))
	(item (text)) (item (naked_variable (squareProperty (string)) (dotProperty) (squareProperty (number)) (squareProperty (naked_variable)))) (item (text))
)
