============================================
comments
============================================

<!-- comment --> inline text <!-- inline comment -->
newline text
<!-- newline comment -->
--------------------------------------------

(source_file
	(comment)
	(item (word)) (item (word))
	(comment)
	(item (word)) (item (word))
	(comment))

============================================
text
============================================
validtext: 123456789 &é(-è_çà)=;:!ù*$^<>.
--------------------------------------------
(source_file
	(item (word))
	(item (expression (literal (number))))
	(item (word))
)

============================================
naked variables dot property
============================================
$variable
$variable.property
$variable.property . subproperty
This is $inlinevariable.dotProperty item
--------------------------------------------
(source_file
	(item (naked_variable))
	(item (naked_variable (dotProperty)))
	(item (naked_variable (dotProperty) (dotProperty)))
	(item (word)) (item (word))
	(item (naked_variable (dotProperty)))
	(item (word))
)
============================================
naked variable square property
============================================
$inlinevariable[100]
$inlinevariable["property string"]
$inlinevariable['property']
$inlinevariable[$indexOrPropertyVariable]
$inlinevariable['property'][50][$indexOrPropertyVariable]
This is mixed $inlinevariable['property'].property[50][$property] items
--------------------------------------------
(source_file
	(item (naked_variable (squareProperty (expression (literal (number))))))
	(item (naked_variable (squareProperty (expression (literal (string))))))
	(item (naked_variable (squareProperty (expression (literal (string))))))
	(item (naked_variable (squareProperty (expression (naked_variable)))))
	(item (naked_variable (squareProperty (expression (literal (string)))) (squareProperty (expression (literal (number)))) (squareProperty (expression (naked_variable)))))
	(item (word)) (item (word)) (item (word)) (item (naked_variable (squareProperty (expression (literal (string)))) (dotProperty) (squareProperty (expression (literal (number)))) (squareProperty (expression (naked_variable))))) (item (word))
)
============================================
number expressions precedence
============================================
2+2
2-2
2*2
2/2
1+2+3+4
1-2/3
1-2/3+4*5
--------------------------------------------
(source_file
	(item (expression (expression (literal (number))) (expression (literal (number)))))
	(item (expression (expression (literal (number))) (expression (literal (number)))))
	(item (expression (expression (literal (number))) (expression (literal (number)))))
	(item (expression (expression (literal (number))) (expression (literal (number)))))
	(item (expression (expression (expression (expression (literal (number))) (expression (literal (number)))) (expression (literal (number)))) (expression (literal (number)))))
	(item (expression (expression (literal (number))) (expression (expression (literal (number))) (expression (literal (number))))))
	(item
		(expression
			(expression
				(expression (literal (number)))
				(expression 
					(expression (literal (number))) 
					(expression (literal (number)))) 
			)
			(expression
					(expression (literal (number))) 
					(expression (literal (number)))
			)
		)
	)
)
============================================
string and naked variable expressions 
============================================
"a"+"b"
$i+$j
$i+"string"
$i["a"+"b"]
--------------------------------------------
(source_file
	(item 
		(expression
			(expression (literal (string)))
			(expression (literal (string)))))
	(item 
		(expression
			(expression (naked_variable))
			(expression (naked_variable))))
	(item 
		(expression
			(expression (naked_variable))
			(expression (literal (string)))))
	(item
		(naked_variable 
			(squareProperty
				(expression
					(expression (literal (string)))
					(expression (literal (string)))))))
)
============================================
strings
============================================
"double quotes"
'single quotes'
"special chars 12345 &é(-è_çà)=;:!ù*$^"
--------------------------------------------
(source_file
	(item (expression (literal (string))))
	(item (expression (literal (string))))
	(item (expression (literal (string))))
)
============================================
nowiki markup variables
============================================
"""$name"""
<nowiki>$name</nowiki>
$$name
{{{$name}}}
--------------------------------------------
(source_file
	(item	(triple_quotes_naked_variable (naked_variable)))
	(item	(nowiki_naked_variable (naked_variable)))
	(item	(escaped_naked_variable (naked_variable)))
	(item	(code_naked_variable (naked_variable)))
)
============================================
link
============================================
[[Link]]
[[Text|Link]]
[[Link][Setter]]
[[Text|Link][Setter]]
--------------------------------------------
(source_file
	(item (link (word_link)))
	(item (link (word_link) (word_link)))
	(item (link (word_link) (word_link)))
	(item (link (word_link) (word_link) (word_link)))
)
